Repository: cysk003/Xray_bash_onekey
Catalog: po/*.po
Languages: fa, ru

source: 提醒
fa: یادآوری کردن
ru: напоминать

source: 错误
fa: اشتباه
ru: ошибка

source: 警告
fa: هشدار دادن
ru: предупреждать

source: 未安装
fa: نصب نشده است
ru: Не установлен

source: 日志文件归档失败
fa: بایگانی پرونده ورود به سیستم انجام نشد
ru: Архивирование файла журнала не удалось

source: 清空日志文件失败
fa: پرونده ورود به سیستم را پاک کنید
ru: Очистить файл журнала.

source: 日志文件已轮转并归档为
fa: پرونده log به صورت چرخشی و بایگانی شده است
ru: Файл журнала был повернут и архив как

source: 当前系统为
fa: سیستم فعلی است
ru: Текущая система

source: 不在支持的系统列表内, 安装中断!
fa: نصب شده در لیست سیستم که پشتیبانی نمی شود!
ru: Установлено в списке систем, который не поддерживается!

source: 当前用户是 root用户, 进入安装流程
fa: کاربر فعلی کاربر root است ، فرایند نصب را وارد کنید
ru: Текущий пользователь - root user, введите процесс установки

source: 当前用户不是 root用户, 请切换到 root用户 后重新执行脚本!
fa: کاربر فعلی یک کاربر اصلی نیست ، لطفاً پس از جابجایی به کاربر root ، اسکریپت را دوباره انتخاب کنید!
ru: Текущий пользователь не является пользователем root, пожалуйста, повторно переключите скрипт после перехода на пользователя root!

source: 无法获取远程语言文件信息
fa: برای به دست آوردن اطلاعات فایل زبانی از راه دور امکان پذیر نیست
ru: Невозможно получить информацию о файле удаленного языка

source: 正在更新语言文件...
fa: پرونده های زبانی را به روز کنید ...
ru: Обновление языковых файлов ...

source: 语言文件更新失败
fa: به روزرسانی پرونده زبانی انجام نشد
ru: Не удалось обновление языкового файла

source: 语言文件无效
fa: پرونده زبانی نامعتبر است
ru: Языковой файл недействителен

source: 语言文件更新完成
fa: به روزرسانی پرونده زبانی تکمیل شده است
ru: Обновление языкового файла завершено

source: 正在安装 gettext...
fa: GetText در حال نصب است ...
ru: GetText устанавливается ...

source: gettext 安装失败，将使用默认语言
fa: نصب GetText انجام نشد ، و از زبان پیش فرض استفاده خواهد شد
ru: Установка getText не удалась, и язык по умолчанию будет использоваться

source: 未找到 gettext.sh，将使用默认语言
fa: هیچ GetText.sh یافت نمی شود ، از زبان پیش فرض استفاده می شود
ru: GetText.sh не найден, язык по умолчанию будет использоваться

source: 不支持的语言:
fa: زبان غیرقانونی:
ru: Язык не поддается:

source: ，将使用默认语言
fa: ، از زبان پیش فرض استفاده خواهد کرد
ru: , Будет использовать язык по умолчанию

source: 语言文件更新失败，将使用默认语言
fa: به روزرسانی های فایل زبانی انجام نشد ، و از زبان پیش فرض استفاده خواهد شد
ru: Обновления языковых файлов не удалось, и язык по умолчанию будет использоваться

source: 发现语言文件更新
fa: به روزرسانی پرونده زبان را کشف کنید
ru: Откройте для себя обновление языкового файла

source: 完成
fa: پایان
ru: Заканчивать

source: 失败
fa: شکست خوردن
ru: неудача

source: 在线版本检测失败, 请稍后再试!
fa: نسخه آنلاین آزمون انجام نشد ، لطفاً بعداً آن را امتحان کنید!
ru: Онлайн -версия теста не удалась, попробуйте позже!

source: 安装
fa: نصب کردن
ru: Установить

source: 已安装
fa: نصب شده
ru: Установлен

source: 自启动配置
fa: پیکربندی خود نشر
ru: Самостоятельная конфигурация

source: 链接库安装
fa: نصب کتابخانه پیوند
ru: Установка библиотеки ссылок

source: 值为空或超出范围, 请重新输入!
fa: مقدار خالی یا فراتر از محدوده است ، لطفاً دوباره وارد شوید!
ru: Значение пустое или за пределами диапазона, пожалуйста, повторно!

source: 值为空, 请重新输入!
fa: ارزش خالی است ، لطفاً دوباره وارد شوید!
ru: Значение пусто, пожалуйста, повторно!

source: 确定 连接端口
fa: درگاه اتصال را تعیین کنید
ru: Определить порт соединения

source: 请输入连接端口
fa: لطفاً درگاه اتصال را وارد کنید
ru: Пожалуйста, введите порт подключения

source: 默认值
fa: مقدار پیش فرض
ru: значение по умолчанию

source: 请输入 0-65535 之间的值!
fa: لطفاً مقدار بین 0-65535 را وارد کنید!
ru: Пожалуйста, введите значение между 0-65535!

source: 端口 9443 不允许使用, 请重新输入!
fa: بندر 9443 مجاز به استفاده نیست ، لطفاً دوباره وارد شوید!
ru: Порт 9443 не разрешается использовать, пожалуйста, повторно!

source: 请选择 安装协议 ws/gRPC
fa: لطفاً پروتکل نصب WS/GRPC را انتخاب کنید
ru: Выберите протокол установки WS/GRPC

source: 默认
fa: پیش فرض
ru: по умолчанию

source: 请输入
fa: لطفا وارد کنید
ru: Пожалуйста, введите

source: 请输入有效的数字
fa: لطفا شماره های معتبر را وارد کنید
ru: Пожалуйста, введите действительные номера

source: 是否添加简单 ws/gRPC 协议 用于负载均衡
fa: آیا می توان یک پروتکل WS/GRPC ساده برای تعادل بار اضافه کرد
ru: Добавить ли простой протокол WS/GRPC для балансировки нагрузки

source: 如不清楚具体用途, 请勿选择!
fa: اگر استفاده خاص را نمی دانید ، انتخاب نکنید!
ru: Если вы не знаете конкретного использования, не выбирайте!

source: 已跳过添加简单 ws/gRPC 协议
fa: برای افزودن پروتکل ساده WS/GRPC پرش کنید
ru: Пропустить, чтобы добавить простой протокол WS/GRPC

source: 是否需要自定义 ws inbound_port
fa: آیا به WS inbound_port سفارشی نیاز دارید
ru: Вам нужен пользовательский ws inbound_port

source: 请输入自定义 ws inbound_port
fa: لطفاً WS INBOUND_PORT را وارد کنید
ru: Пожалуйста, введите пользовательский ws inbound_port

source: 请勿与其他端口相同!
fa: مانند سایر درگاه ها نباشید!
ru: Не будьте такими же, как другие порты!

source: 是否需要自定义 gRPC inbound_port
fa: آیا به GRPC inbound_port سفارشی نیاز دارید
ru: Вам нужен пользовательский grpc inbound_port

source: 请输入自定义 gRPC inbound_port
fa: لطفاً GRPC سفارشی inbound_port را وارد کنید
ru: Пожалуйста, введите пользовательский grpc inbound_port

source: 是否需要设置防火墙
fa: آیا شما نیاز به تنظیم فایروال دارید
ru: Вам нужно настроить брандмауэр

source: 防火墙 重启 完成
fa: تکمیل راه اندازی مجدد فایروال
ru: Перезагрузка брандмауэра

source: 开放防火墙相关端口
fa: بندر مرتبط با فایروال
ru: Открытый брандмауэр -связанный порт

source: 若修改配置, 请注意关闭防火墙相关端口
fa: اگر پیکربندی را اصلاح کردید ، لطفاً برای خاموش کردن پورت مرتبط با فایروال توجه کنید
ru: Если вы измените конфигурацию, обратите внимание на отключение порта, связанного с брандмауэром

source: 配置 Xray FullCone
fa: Xray FullCone را پیکربندی کنید
ru: Настройте XRay FullCone

source: 跳过防火墙设置
fa: تنظیمات فایروال را پرش کنید
ru: Пропустить настройки брандмауэра

source: 是否需要自定义 ws 伪装路径
fa: آیا به یک مسیر استتار WS سفارشی نیاز دارید
ru: Вам нужен собственный камуфляжный путь ws

source: 请输入自定义 ws 伪装路径
fa: لطفاً مسیر استتار WS سفارشی را وارد کنید
ru: Пожалуйста, введите пользовательский путь камуфляжа WS

source: 不需要
fa: غیر ضروری
ru: ненужный

source: 伪装路径
fa: استتار
ru: Камуфляж

source: 是否需要修改 ws 伪装路径
fa: آیا شما نیاز به تغییر مسیر استتار WS دارید
ru: Вам нужно изменить путь камуфляжа WS

source: 是否需要自定义 gRPC 伪装路径
fa: آیا به یک مسیر استتار GRPC سفارشی نیاز دارید؟
ru: Вам нужен собственный камуфляж GRPC?

source: 请输入自定义 gRPC 伪装路径
fa: لطفاً مسیر استتار GRPC سفارشی را وارد کنید
ru: Пожалуйста, введите пользовательский путь камуфляжа GRPC

source: 是否需要修改 gRPC 伪装路径
fa: آیا شما نیاز به تغییر مسیر استتار GRPC دارید
ru: Вам нужно изменить путь камуфляжа GRPC

source: 是否需要自定义 Xray 用户名
fa: آیا به نام کاربری xray سفارشی نیاز دارید
ru: Вам нужна специально рентгеновское имя пользователя

source: 请输入合法的email
fa: لطفا ایمیل قانونی را وارد کنید
ru: Пожалуйста, введите законное письмо

source: Xray 用户名
fa: نام کاربری Xray
ru: Рентгеновское имя пользователя

source: 是否需要自定义字符串映射为 UUIDv5
fa: آیا به UUIDV5 به نقشه برداری رشته ای سفارشی نیاز دارید
ru: Вам нужно индивидуальное отображение строк в UUIDV5

source: 请输入自定义字符串
fa: لطفا رشته سفارشی را وارد کنید
ru: Пожалуйста, введите настраиваемую строку

source: 最多30字符
fa: حداکثر 30 نویسه
ru: До 30 символов

source: 自定义字符串
fa: رشته سفارشی
ru: Пользовательская строка

source: UUID 映射字符串
fa: رشته نقشه برداری UUID
ru: Uuid mapping String

source: 检测到 target 域名已配置, 是否保留
fa: نام دامنه هدف پیکربندی شده است ، چه حفظ شده باشد
ru: Целевое доменное имя было настроено, независимо от того, сохраняется оно

source: 请输入一个域名
fa: لطفا یک نام دامنه وارد کنید
ru: Пожалуйста, введите доменное имя

source: 域名要求支持 TLSv1.3、X25519 与 H2 以及域名非跳转用
fa: نام دامنه نیاز به پشتیبانی از TLSV1.3 ، x25519 و H2 و نام دامنه غیر جمپ دارد
ru: Доменное имя требует поддержки TLSV1.3, X25519 и H2, а также доменное имя не -JUPP

source: 确认域名符合要求后请输入
fa: لطفاً پس از تأیید اینکه نام دامنه شرایط را برآورده می کند ، وارد کنید
ru: Пожалуйста, введите после подтверждения того, что доменное имя соответствует требованиям

source: 正在检测域名请等待
fa: لطفا منتظر نام دامنه باشید
ru: Подождите доменного имени

source: 该域名不支持 TLSv1.3
fa: این نام دامنه از TLSV1.3 پشتیبانی نمی کند
ru: Это доменное имя не поддерживает TLSV1.3

source: 该域名不支持 X25519
fa: این نام دامنه از x25519 پشتیبانی نمی کند
ru: Это доменное имя не поддерживает x25519

source: 该域名不支持 HTTP/2
fa: این نام دامنه از http/2 پشتیبانی نمی کند
ru: Это доменное имя не поддерживает http/2

source: 该域名发生了跳转
fa: نام دامنه پرید
ru: Доменное имя прыгнуло

source: 该域名可能不满足所有要求
fa: این نام دامنه ممکن است تمام شرایط را برآورده نکند
ru: Это доменное имя может не соответствовать всем требованиям

source: 是否仍要设置此域名
fa: آیا هنوز باید این نام دامنه را تنظیم کنید
ru: Вам все еще нужно установить это доменное имя

source: 域名
fa: نام دامنه
ru: доменное имя

source: 满足所有要求
fa: همه شرایط را برآورده کنید
ru: Соответствовать всем требованиям

source: target 域名
fa: نام دامنه هدف
ru: целевое доменное имя

source: 是否需要修改
fa: آیا شما نیاز به اصلاح دارید
ru: Вам нужно изменить

source: 域名的 serverNames 用户名
fa: نام کاربری نام دامنه
ru: ServerNames Имя пользователя доменного имени

source: 默认为
fa: پیش فرض
ru: По умолчанию

source: 域名的本身
fa: نام دامنه خود
ru: Само доменное имя

source: 如不清楚具体用途, 请勿继续!
fa: اگر استفاده خاص را نمی دانید ، ادامه ندهید!
ru: Если вы не знаете конкретного использования, не продолжайте!

source: 是否变更 Nginx 负载均衡
fa: آیا تعادل بار nginx را تغییر دهید
ru: Изменить ли балансировку нагрузки NGINX

source: 请选择协议为 ws 或 gRPC
fa: لطفاً پروتکل WS یا GRPC را انتخاب کنید
ru: Пожалуйста, выберите протокол в WS или GRPC

source: 返回
fa: بازگشت
ru: возвращаться

source: 请重新输入正确的数字
fa: لطفا شماره صحیح را دوباره وارد کنید
ru: Пожалуйста, повторьте правильный номер

source: 本地文件 file_manager.sh 不存在，正在下载...
fa: File File_manager.sh وجود ندارد ، بارگیری ...
ru: Local File File_Manager.sh не существует, загрузка ...

source: 下载失败，请手动下载并安装新版本
fa: بارگیری انجام نشد ، لطفاً نسخه جدید را به صورت دستی بارگیری و نصب کنید
ru: Скачать не удалась, пожалуйста, загрузите и установите новую версию вручную

source: 无效选项 请重试
fa: گزینه های نامعتبر لطفا آن را امتحان کنید
ru: Неотверждаемые параметры, пожалуйста, попробуйте

source: 当前模式不支持此操作!
fa: حالت فعلی از این عملیات پشتیبانی نمی کند!
ru: Текущий режим не поддерживает эту операцию!

source: 是否变更 Nginx serverNames 配置
fa: آیا برای تغییر پیکربندی nginx servername
ru: Изменить ли конфигурацию Nginx ServerNames

source: 配置用途可以参考文章
fa: برای پیکربندی می توانید به مقاله مراجعه کنید.
ru: Вы можете обратиться к статье для конфигурации.

source: 敬请期待
fa: لطفا مشتاقانه منتظر باشید
ru: Пожалуйста, с нетерпением жду возможности

source: Xray listen address 修改
fa: Xray Liste Address اصلاح
ru: Рентген

source: Xray inbound port 修改
fa: اصلاح پورت ورودی Xray
ru: Рентгеновская модификация порта

source: Nginx port 修改
fa: اصلاح درگاه Nginx
ru: Модификация порта Nginx

source: Xray port 修改
fa: اصلاح بندر Xray
ru: Модификация порта рентгеновского порта

source: 端口号
fa: شماره بندر
ru: Номер порта

source: Xray 伪装路径 修改
fa: اصلاح مسیر استتار Xray
ru: Рентгеновский камуфляж модификация пути

source: Reality 不支持 path
fa: واقعیت از مسیر پشتیبانی نمی کند
ru: Реальность не поддерживает путь

source: Xray 用户名 修改
fa: اصلاح نام کاربری Xray
ru: Рентгеновская модификация имени пользователя

source: 请先删除 多余的用户
fa: لطفاً ابتدا کاربران اضافی را حذف کنید
ru: Сначала удалите лишние пользователей

source: Xray UUID 修改
fa: اصلاح UUID Xray
ru: Рентгеновская модификация

source: target serverNames 配置修改
fa: اصلاح پیکربندی Servernames Target
ru: Целевая модификация конфигурации ServerNames

source: privateKey 和 shortIds 配置修改
fa: تغییر پیکربندی Private Key و ShortIDS
ru: Модификация конфигурации PrivateKey и Shortids

source: Xray reality listen address 修改
fa: Xray Reality Listend
ru: Рентгеновская реальность прослушивание модификация адреса

source: 检测到 Xray 的权限控制, 启动擦屁股程序
fa: کنترل مجوزهای Xray شناسایی شده است و برنامه خراش شروع می شود
ru: Обнаружен контроль разрешений рентгеновского происхождения, и запускается программа царапин

source: Xray 擦屁股 完成
fa: xray برای تکمیل باسن
ru: Рентгеновский потирание приклада, чтобы завершить

source: 安装 Xray
fa: Xray را نصب کنید
ru: Установите рентген

source: 已安装 Xray
fa: Xray نصب شده است
ru: Рентген был установлен

source: 若更新无效, 建议直接卸载再安装!
fa: اگر به روزرسانی نامعتبر باشد ، توصیه می شود مستقیماً آن را حذف کرده و سپس آن را نصب کنید!
ru: Если обновление недействительно, рекомендуется удалить его напрямую, а затем установить его!

source: 部分新功能需要重新安装才可生效
fa: برخی از کارکردهای جدید قبل از شروع کار باید دوباره نصب شوند
ru: Некоторые новые функции должны быть переустановлены, прежде чем они смогут вступить в силу

source: 检测到存在最新版
fa: آخرین نسخه شناسایی شده است
ru: Последняя версия обнаружена

source: 脚本可能未兼容此版本
fa: اسکریپت ممکن است با این نسخه سازگار نباشد
ru: Сценарий может быть не совместим с этой версией

source: 是否更新
fa: آیا به روز رسانی
ru: Обновлять

source: 即将升级
fa: پیشرفت کردن
ru: Улучшать

source: 升级
fa: بالا بردن
ru: обновление

source: 即将升级/重装
fa: بهبود یافته/نصب شده
ru: Улучшен/переустановлен

source: 升级/重装
fa: ارتقا/نصب مجدد
ru: Обновление/переустановка

source: Reality 协议有流量偷跑的风险
fa: پروتکل واقعیت خطر سرقت ترافیک را دارد
ru: Протокол реальности имеет риск кражи трафика

source: 该风险在 target 网址被 cdn 加速时存在
fa: این خطر هنگام تسریع در وب سایت هدف توسط CDN وجود دارد
ru: Этот риск существует, когда целевой веб -сайт ускоряется CDN

source: 是否额外安装 nginx 前置保护(推荐)
fa: آیا برای نصب NGINX قبل از محافظت (توصیه می شود)
ru: Должно ли установить предварительную защиту Nginx (рекомендуется)

source: 已跳过安装
fa: نصب
ru: Пропустить установку

source: Nginx 已存在, 跳过编译安装过程
fa: nginx در حال حاضر وجود دارد ، پرش از فرآیند تدوین و نصب
ru: Nginx уже существует, пропуская процесс компиляции и установки

source: 检测到旧版本安装的
fa: نسخه قدیمی نصب شد
ru: Старая версия была установлена

source: 请先做好备份
fa: لطفاً ابتدا پشتیبان تهیه کنید
ru: Сначала сделайте резервную копию

source: 是否需要删除 (请删除)
fa: آیا شما نیاز به حذف دارید (لطفا حذف کنید)
ru: Вам нужно удалить (пожалуйста, удалите)

source: 已跳过删除
fa: حذف حذف
ru: Пропустить удаление

source: 日志目录已更改, 日志清除需要重新设置
fa: فهرست ورود به سیستم تغییر یافته است ، و نیاز به تنظیم مجدد ورود به سیستم
ru: Справочник журнала был изменен, и очистка журнала должно быть сброшено

source: 检测到其他套件安装的 Nginx, 继续安装会造成冲突, 请处理后安装!
fa: NGINX که در کیت های دیگر نصب شده است ، ادامه نصب باعث درگیری می شود.
ru: NGINX, установленная в других наборах, продолжение установки вызовет конфликты.

source: 即将下载已编译的
fa: این مجموعه در حال بارگیری است
ru: Компиляция собирается загрузить

source: Nginx 配置文件不完整, 退出升级!
fa: پرونده پیکربندی NGINX ناقص است ، خروج و به روزرسانی!
ru: Файл конфигурации Nginx неполный, выходить и обновить!

source: 配置文件不完整, 退出升级
fa: پرونده پیکربندی ناقص ، خروج و به روزرسانی است
ru: Файл конфигурации неполный, выходить и обновлять

source: 当前安装模式不需要
fa: حالت نصب فعلی لازم نیست
ru: Текущий режим установки не требуется

source: Nginx 配置文件不存在, 退出升级!
fa: پرونده پیکربندی NGINX وجود ندارد ، خروج و به روزرسانی!
ru: Файл конфигурации nginx не существует, выходит и обновляется!

source: 配置文件不存在, 退出升级
fa: پرونده پیکربندی وجود ندارد ، خروج و به روز رسانی می کند
ru: Файл конфигурации не существует, выходить и обновлять

source: 删除旧版
fa: نسخه قدیمی را حذف کنید
ru: Удалить старую версию

source: 是否保留原 Nginx 配置文件
fa: آیا برای نگه داشتن فایل پیکربندی اصلی nginx
ru: Сохранить исходный файл конфигурации Nginx

source: 原配置文件已删除!
fa: پرونده پیکربندی اصلی حذف شده است!
ru: Исходный файл конфигурации был удален!

source: 原配置文件已保留!
fa: پرونده پیکربندی اصلی حفظ شده است!
ru: Оригинальный файл конфигурации был сохранен!

source: 已为最新版
fa: آخرین نسخه بوده است
ru: Был последней версией

source: 设置后台定时自动更新程序 (包含: 脚本/Xray/Nginx)
fa: هنگام تنظیم پس زمینه ، برنامه به روزرسانی خودکار (از جمله: script/xray/nginx) را تنظیم کنید
ru: Установите программу автоматического обновления (включая: script/xray/nginx) при настройке фона

source: 可能自动更新后有兼容问题, 谨慎开启
fa: ممکن است بعد از بروزرسانی خودکار مشکلات سازگار وجود داشته باشد و با احتیاط باز شود
ru: После автоматического обновления могут быть совместимые проблемы и откройте осторожно

source: 是否开启
fa: باز کردن
ru: Открыть ли

source: 设置自动更新
fa: به روزرسانی خودکار را تنظیم کنید
ru: Установите автоматическое обновление

source: 已设置自动更新
fa: به روزرسانی خودکار را تنظیم کنید
ru: Установите автоматическое обновление

source: 是否关闭
fa: آیا بستن
ru: Закрыть ли

source: 删除自动更新
fa: به روزرسانی خودکار را حذف کنید
ru: Удалить автоматическое обновление

source: 安装 SSL 证书生成脚本依赖
fa: مجوز SSL تولید وابستگی های اسکریپت را نصب کنید
ru: Установить зависимости сценария сценария SSL -сертификаты

source: 安装 SSL 证书生成脚本
fa: برای تولید اسکریپت ، گواهی SSL را نصب کنید
ru: Установите сертификат SSL для создания сценария

source: 检测到原域名配置存在, 是否跳过域名设置
fa: حضور پیکربندی نام دامنه اصلی شناسایی شده است ، خواه از تنظیمات نام دامنه استفاده کنید
ru: Обнаружено наличие исходной конфигурации доменного имени, независимо от того, пропустить настройки доменного имени

source: 已跳过域名设置
fa: تنظیمات نام دامنه را پرش کنید
ru: Пропустить настройки доменного имени

source: 确定域名信息
fa: اطلاعات دامنه را تعیین کنید
ru: Определить информацию домена

source: 请输入你的域名信息
fa: لطفاً اطلاعات نام دامنه خود را وارد کنید
ru: Пожалуйста, введите информацию о своем доменном имени

source: 请选择公网IP(IPv4/IPv6)或手动输入域名
fa: لطفاً IP شبکه عمومی (IPv4/IPv6) را انتخاب کنید یا نام دامنه را به صورت دستی وارد کنید
ru: Пожалуйста, выберите IP Public Network IP (IPv4/IPv6) или вручную введите доменное имя

source: 不推荐
fa: توصیه نکنید
ru: Не рекомендую

source: 正在获取公网IP信息, 请耐心等待
fa: اطلاعات IP شبکه عمومی را دریافت کنید ، لطفا صبر صبر کنید
ru: Получите информацию об публичной сети IP, пожалуйста, подождите терпеливо

source: 此选项用于服务器商仅提供域名访问服务器
fa: این گزینه برای فروشندگان سرور استفاده می شود تا فقط سرورهای دسترسی به نام دامنه ارائه دهند
ru: Эта опция используется для поставщиков серверов для предоставления только серверов домена доменного имени

source: 注意服务器商域名添加 CNAME 记录
fa: توجه داشته باشید که نام دامنه کسب و کار سرور اضافه شده است
ru: Обратите внимание, что имя бизнес -домена сервера добавлено

source: 域名DNS解析IP
fa: دامنه تجزیه و تحلیل DNS IP
ru: Домен DNS -анализ IP

source: 公网IP/域名
fa: نام IP/دامنه شبکه عمومی
ru: Общедоступная сеть IP/доменное имя

source: 域名DNS解析IP与公网IP匹配
fa: DOMAIN DNS Analysis IP و IP Network IP مطابقت دارد
ru: Домен DNS -анализ IP и Match Public Network IP

source: 请确保域名添加了正确的 A/AAAA 记录, 否则将无法正常使用 Xray
fa: لطفاً اطمینان حاصل کنید که نام دامنه رکورد صحیح A/AAAA را اضافه می کند ، در غیر این صورت قادر به استفاده از Xray به طور عادی نخواهد بود
ru: Пожалуйста, убедитесь, что доменное имя добавляет правильную запись A/AAAA, в противном случае оно не сможет использовать рентген обычно

source: 域名DNS解析IP与公网IP不匹配, 请选择
fa: دامنه DNS تجزیه شده IP با IP شبکه عمومی مطابقت ندارد ، لطفا انتخاب کنید
ru: Домен DNS SACERSING IP не соответствует IP общедоступной сети, пожалуйста, выберите

source: 继续安装
fa: به نصب ادامه دهید
ru: Продолжайте устанавливать

source: 重新输入
fa: مجدداً
ru: Re -Enter

source: 终止安装
fa: نصب را خاتمه دهید
ru: Завершить установку

source: 安装终止
fa: نصب کردن
ru: Установить

source: 检测到原IP配置存在, 是否跳过IP设置
fa: تشخیص وجود پیکربندی IP اصلی ، خواه از تنظیمات IP استفاده کنید
ru: Обнаружение существования исходной конфигурации IP, будь то пропустить настройки IP

source: 已跳过IP设置
fa: تنظیمات IP را پرش کنید
ru: Пропустить настройки IP

source: 确定公网IP信息
fa: اطلاعات IP شبکه عمومی را تعیین کنید
ru: Определить информацию об публичной сети IP

source: 请选择公网IP为IPv4或IPv6
fa: لطفاً IP شبکه عمومی را به عنوان IPv4 یا IPv6 انتخاب کنید
ru: Пожалуйста, выберите IP Public Network как IPv4 или IPv6

source: 手动输入
fa: ورودی دستی
ru: Вручную ввод

source: 尝试自动 kill 占用进程
fa: روند کار خودکار کشتن را امتحان کنید
ru: Попробуйте процесс автоматического убийства

source: kill 完成
fa: کشتن کامل
ru: Убить полным

source: SSL 证书测试签发成功, 开始正式签发
fa: آزمون گواهینامه SSL با موفقیت صادر شد و صدور رسمی به طور رسمی صادر شد
ru: Тест на сертификат SSL был успешно выпущен, и официальное выпуск был официально выпущен

source: SSL 证书测试签发失败
fa: صدور گواهینامه SSL انجام نمی شود
ru: Выпуск теста на сертификат SSL не удастся

source: SSL 证书生成成功
fa: موفقیت تولید گواهینامه SSL
ru: Успех генерации сертификатов SSL

source: 证书配置成功
fa: پیکربندی گواهینامه موفق
ru: Успешная конфигурация сертификата

source: SSL 证书生成失败
fa: خرابی تولید گواهینامه SSL
ru: Сбой генерации сертификатов SSL

source: 检测到 Xray 配置过多用户
fa: آزمایش بیش از حد کاربران در پیکربندی Xray
ru: Тестирование слишком много пользователей в конфигурации XRay

source: 是否保留原 Xray 配置文件
fa: اینکه آیا پرونده پیکربندی اصلی Xray را نگه دارید
ru: Сохранить исходный файл конфигурации рентгеновского языка

source: 添加简单 ws/gRPC 协议
fa: پروتکل ساده WS/GRPC را اضافه کنید
ru: Добавить простой протокол WS/GRPC

source: 检测到配置文件, 是否读取配置文件
fa: فایل پیکربندی را تشخیص دهید ، آیا پرونده پیکربندی را بخوانید
ru: Обнаружение файла конфигурации, будь то прочитать файл конфигурации

source: 已删除配置文件
fa: پرونده پیکربندی حذف شده
ru: Удаленный файл конфигурации

source: 已保留配置文件
fa: پرونده پیکربندی حفظ شده است
ru: Файл конфигурации был сохранен

source: 检测到当前安装模式与配置文件的安装模式不一致
fa: حالت نصب فعلی تشخیص داده شده است که حالت نصب پرونده پیکربندی متناقض است
ru: Обнаружен текущий режим установки, что режим установки файла конфигурации не согласуется

source: 是否保留配置文件 (强烈不建议)
fa: آیا برای نگه داشتن پرونده پیکربندی (قوی توصیه نمی شود)
ru: Сохранить ли файл конфигурации (не рекомендуется сильнее)

source: 请务必确保配置文件正确
fa: لطفاً اطمینان حاصل کنید که پرونده پیکربندی صحیح است
ru: Пожалуйста, убедитесь, что файл конфигурации верен

source: 检测到配置文件不完整, 是否保留配置文件
fa: پرونده پیکربندی کامل نیست ، آیا پرونده پیکربندی حفظ شده است
ru: Файл конфигурации не завершен, сохраняется ли файл конфигурации

source: Nginx SSL 配置修改
fa: تغییر پیکربندی NGINX SSL
ru: Модификация конфигурации Nginx SSL

source: Nginx 配置修改
fa: اصلاح پیکربندی nginx
ru: Модификация конфигурации NGINX

source: Nginx serverNames 配置修改
fa: تغییر پیکربندی Nginx Servernames
ru: Nginx servernames modication конфигурации

source: Nginx serverNames 配置删除
fa: پیکربندی Nginx Servernames حذف
ru: Nginx ServerNames Configuration Delete

source: Nginx servers 配置修改
fa: اصلاح پیکربندی سرور Nginx
ru: Модификация конфигурации сервера NGINX

source: 设置 Nginx 开机自启
fa: nginx را تنظیم کنید و شروع به کار خود کنید
ru: Установите Nginx и запустите себя

source: 设置 Xray 开机自启
fa: Self -Starting Xray Boot را تنظیم کنید
ru: Установить xray boot self -catharting

source: 关闭 Nginx 开机自启
fa: nginx را خاموش کنید و شروع به کار خود کنید
ru: Выключите Nginx и начните самостоятельно

source: 关闭 Xray 开机自启
fa: Xray را خاموش کنید و شروع به کار کنید
ru: Выключите рентген, чтобы начать и начать самостоятельно

source: 停止已有服务
fa: سرویس موجود را متوقف کنید
ru: Прекратите существующую услугу

source: Nginx 重启
fa: nginx راه اندازی مجدد
ru: Nginx перезапуск

source: Xray 重启
fa: دوباره راه اندازی مجدد
ru: Рентгеновский перезапуск

source: Nginx 启动
fa: شروع nginx
ru: Nginx start

source: Xray 启动
fa: Xray start
ru: Рентгеновский старт

source: Nginx 停止
fa: Nginx Stop
ru: Nginx остановка

source: Xray 停止
fa: Xray Stop
ru: Рентгеновский остановка

source: 新版本已自动设置证书自动更新
fa: نسخه جدید به طور خودکار به طور خودکار به روز شده است
ru: Новая версия автоматически настроена автоматически

source: 老版本请及时删除 废弃的 改版证书自动更新!
fa: لطفاً گواهی تجدید نظر متروکه را به طور خودکار به موقع حذف کنید!
ru: Пожалуйста, удалите заброшенный сертификат пересмотра автоматически вовремя!

source: 已设置改版证书自动更新
fa: به طور خودکار گواهی تجدید نظر را به روز کنید
ru: Автоматически обновлять сертификат пересмотра

source: 是否需要删除改版证书自动更新 (请删除)
fa: آیا باید گواهی تجدید نظر را حذف کرده و به طور خودکار به روز کنید (لطفا حذف کنید)
ru: Вам нужно автоматически удалить сертификат пересмотра и обновлять (пожалуйста, удалите)

source: 删除改版证书自动更新
fa: به روزرسانی خودکار گواهی تجدید نظر را حذف کنید
ru: Удалить автоматическое обновление сертификата пересмотра

source: 已过期
fa: گسترش
ru: Расширение

source: 证书生成日期
fa: تاریخ تولید گواهینامه
ru: Дата генерации сертификатов
