Repository: cysk003/Xray_bash_onekey
Catalog: po/*.po
Languages: fa, ru

source: 证书生成天数
fa: روزهای تولید گواهی
ru: Дни генерации сертификатов

source: 证书剩余天数
fa: گواهی روزهای باقی مانده
ru: Сертификат оставшиеся дни

source: 是否立即更新证书
fa: آیا بلافاصله گواهی را به روز می کنید
ru: Вы немедленно обновляете сертификат

source: 证书签发工具不存在, 请确认是否证书为脚本签发!
fa: ابزار صدور گواهینامه وجود ندارد ، لطفاً تأیید کنید که آیا گواهی به عنوان اسکریپت صادر شده است!
ru: Инструмента выпуска сертификата не существует, пожалуйста, подтвердите, выдается ли сертификат в качестве сценария!

source: 证书更新
fa: به روزرسانی گواهی
ru: Обновление сертификата

source: 本地文件 fail2ban_manager.sh 不存在，正在下载...
fa: پرونده محلی fail2ban_manager.sh وجود ندارد ، بارگیری ...
ru: Локальный файл fail2ban_manager.sh не существует, загружая ...

source: 检测到日志文件大小如下:
fa: اندازه پرونده log به شرح زیر است:
ru: Размер файла журнала обнаружен следующим образом:

source: 即将清除!
fa: در حال پاک شدن است!
ru: Это вот -вот будет очищено!

source: 日志清理
fa: پاکسازی ورود به سیستم
ru: Очистка журнала

source: 已设置旧版自动清理日志任务
fa: نسخه قدیمی کار ورود به سیستم تمیز کردن خودکار تنظیم شده است
ru: Была настроена старая версия задачи автоматического журнала очистки

source: 是否需要删除旧版自动清理日志任务
fa: آیا شما نیاز به حذف نسخه قدیمی کار ورود به سیستم اتوماتیک دارید
ru: Вам нужно удалить старую версию задачи автоматического журнала очистки

source: 保留现有自动清理日志任务
fa: کار ورود به سیستم تمیز کردن اتوماتیک موجود را حفظ کنید
ru: Сохранить существующую задачу автоматической очистки журнала

source: 删除旧版自动清理日志任务
fa: نسخه قدیمی کار ورود به سیستم اتوماتیک را حذف کنید
ru: Удалить старую версию задачи автоматической очистки

source: 是否需要设置自动清理日志
fa: آیا شما نیاز به تنظیم یک گزارش تمیز کردن اتوماتیک دارید
ru: Вам нужно настроить автоматическое журнал очистки

source: 清空屏幕!
fa: صفحه را پاک کنید!
ru: Очистите экран!

source: 将在 每周三 04:00 自动清空日志
fa: ورود به سیستم به طور خودکار هر چهارشنبه ساعت 04:00 خالی می شود
ru: Журнал будет автоматически опустошен каждую среду в 04:00

source: 已设置自动清理日志任务
fa: کار ورود به سیستم تمیز کردن خودکار تنظیم شده است
ru: Задача автоматической очистки журнала была установлена

source: 是否需要删除现有自动清理日志任务
fa: آیا شما نیاز به حذف کار ورود به سیستم اتوماتیک موجود دارید
ru: Вам нужно удалить существующую задачу автоматического журнала очистки

source: 删除自动清理日志任务
fa: کار ورود به سیستم خودکار تمیز کردن را حذف کنید
ru: Удалить задачу автоматической очистки

source: 设置自动清理日志
fa: ورود به سیستم تمیز کردن خودکار را تنظیم کنید
ru: Установить автоматическую очистку

source: Xray 配置分享
fa: به اشتراک گذاری پیکربندی Xray
ru: Обмен конфигурацией рентгеновской конфигурации

source: URL 分享链接
fa: لینک اشتراک URL
ru: Ссылка на обмен URL

source: 二维码
fa: کد QR
ru: QR -код

source: ws URL 分享链接
fa: لینک اشتراک URL WS
ru: WS URL -адрес

source: gRPC URL 分享链接
fa: لینک اشتراک URL GRPC
ru: Ссылка на обмен URL GRPC

source: 生成分享链接
fa: پیوند اشتراک گذاری ایجاد کنید
ru: Генерировать ссылку на обмен

source: Xray+Nginx+ws+TLS 安装成功
fa: نصب Xray+nginx+WS+TLS با موفقیت
ru: Xray+nginx+WS+TLS Установка успешно

source: Xray+Nginx+grpc+TLS 安装成功
fa: نصب Xray+nginx+GRPC+TLS با موفقیت
ru: Xray+nginx+grpc+tls установка успешно

source: Xray+Nginx+ws+gRPC+TLS 安装成功
fa: Xray+Nginx+WS+GRPC+TLS نصب موفقیت آمیز
ru: Xray+nginx+ws+grpc+tls Успешная установка

source: Xray+Reality 安装成功
fa: Xray+نصب واقعیت با موفقیت
ru: Установка рентгеновской реальности успешно

source: Xray+Reality+ws 安装成功
fa: Xray+واقعیت+نصب WS با موفقیت
ru: Xray+Reality+WS Установка успешно

source: Xray+Reality+gRPC 安装成功
fa: Xray+واقعیت+نصب GRPC با موفقیت
ru: Xray+Reality+GRPC Установка успешно

source: Xray+Reality+ws+gRPC 安装成功
fa: Xray+واقعیت+نصب WS+GRPC با موفقیت
ru: Xray+Reality+WS+GRPC Установка успешно

source: ws ONLY 安装成功
fa: فقط نصب با موفقیت
ru: Установка WS только успешно

source: gRPC ONLY 安装成功
fa: GRPC فقط نصب موفقیت آمیز
ru: GRPC только успешная установка

source: ws+gRPC ONLY 安装成功
fa: WS+GRPC فقط نصب با موفقیت
ru: Учтение только ws+grpc успешно успешно

source: VLESS 目前分享链接规范为实验阶段, 请自行判断是否适用
fa: Vless در حال حاضر مشخصات لینک را در مرحله آزمایش به اشتراک می گذارد ، لطفاً تعیین کنید که آیا توسط خودتان قابل اجرا است
ru: Vless в настоящее время обменивается спецификациями ссылки на экспериментальной стадии, пожалуйста, определите, применимо ли это самостоятельно

source: Xray 配置信息
fa: اطلاعات پیکربندی Xray
ru: Информация о конфигурации XRAY

source: 主机
fa: میزبان
ru: Хозяин

source: ws 端口
fa: بندر WS
ru: WS Port

source: gRPC 端口
fa: درگاه GRPC
ru: Порт GRPC

source: 端口
fa: بندر
ru: порт

source: Xray ws 端口
fa: پورت Xray WS
ru: Xray ws порт

source: Xray gRPC 端口
fa: درگاه Xray GRPC
ru: Рентгеновский порт GRPC

source: UUIDv5 映射字符串
fa: رشته نقشه برداری UUIDV5
ru: Строка картирования UUIDV5

source: 用户id
fa: شناسه کاربر
ru: ID пользователя

source: 加密
fa: رمز
ru: шифрование

source: 传输协议
fa: پروتکل انتقال
ru: Протокол передачи

source: 底层传输安全
fa: ایمنی انتقال اساسی
ru: Безопасность основной передачи

source: 路径
fa: مسیر
ru: путь

source: 不要落下/
fa: سقوط نکنید/
ru: Не падай/

source: 不需要加/
fa: نیازی به افزودن نیست/
ru: Не нужно добавлять/

source: 流控
fa: کنترل جریان
ru: Управление потоком

source: ws 路径
fa: مسیر WS
ru: WS PATH

source: 即将申请证书, 支持使用自定义证书
fa: برای استفاده به زودی ، از استفاده از گواهینامه های سفارشی پشتیبانی کنید
ru: Чтобы подать заявку в ближайшее время, поддержать использование пользовательских сертификатов

source: 如需使用自定义证书, 请按如下步骤:
fa: اگر نیاز به استفاده از گواهی سفارشی دارید ، لطفاً مراحل زیر را دنبال کنید:
ru: Если вам нужно использовать пользовательский сертификат, пожалуйста, выполните следующие шаги:

source: 1. 将证书文件重命名: 私钥(xray.key)、证书(xray.crt)
fa: 1. سند گواهینامه را تغییر نام دهید: کلید (xray.key) ، گواهی (xray.crt)
ru: 1. Переименовать документ сертификата: ключ (xray.key), сертификат (xray.crt)

source: 2. 将重命名后的证书文件放入
fa: 2. پرونده گواهینامه تغییر نام را در آن قرار دهید
ru: 2. Поместите переименованный файл сертификата в

source: 目录后再运行脚本
fa: فیلمنامه را بعد از دایرکتوری اجرا کنید
ru: Запустите сценарий после каталога

source: 3. 重新运行脚本
fa: 3. فیلمنامه را دوباره اجرا کنید
ru: 3. Запустите сценарий снова

source: 是否继续
fa: آیا ادامه دارد
ru: Продолжать

source: 所有证书文件均已存在, 是否保留
fa: تمام اسناد گواهینامه از قبل وجود دارد ، چه باید نگه دارید
ru: Все документы сертификата уже существуют, будь то

source: 已删除
fa: حذف شده
ru: Удален

source: 证书应用
fa: برنامه گواهینامه
ru: Заявка на сертификат

source: 证书文件已存在, 是否保留
fa: اسناد گواهی وجود داشته است ، چه باید نگه دارید
ru: Документы сертификата существовали, будь то

source: 证书签发残留文件已存在, 是否保留
fa: صدور گواهینامه اسناد باقیمانده وجود داشته است ، آیا حفظ شده است؟
ru: Выдача сертификатов остаточных документов существовало, сохраняется ли он?

source: Nginx systemd ServerFile 添加
fa: nginx systemd serverfile اضافه کردن
ru: Nginx Systemd ServerFile добавить

source: 请选择支持的 TLS 版本
fa: لطفاً نسخه TLS پشتیبانی شده را انتخاب کنید
ru: Пожалуйста, выберите поддерживаемую версию TLS

source: 建议选择 TLS1.3 only (安全模式)
fa: توصیه می شود فقط TLS1.3 را انتخاب کنید (حالت امنیتی)
ru: Рекомендуется выбрать только TLS1.3 (режим безопасности)

source: 兼容模式
fa: حالت سازگار
ru: Совместимый режим

source: 安全模式
fa: حالت امنیتی
ru: Режим безопасности

source: 已切换至 TLS1.3 only
fa: فقط به TLS 1.3 تغییر دهید
ru: Переключитесь только на TLS 1.3

source: Nginx/配置文件不存在 或 当前模式不支持
fa: پرونده nginx/پیکربندی وجود ندارد یا حالت فعلی پشتیبانی نمی شود
ru: Файл Nginx/Configuration не существует, или текущий режим не поддерживается

source: 请先安装 Xray
fa: لطفا ابتدا Xray را نصب کنید
ru: Пожалуйста, установите xray первым

source: 请输入 0-65535 之间的值
fa: لطفاً مقدار بین 0-65535 را وارد کنید
ru: Пожалуйста, введите значение между 0-65535

source: 连接端口号
fa: وصل کردن
ru: Соединять

source: 请输入 ws inbound_port
fa: لطفاً WS inbound_port را وارد کنید
ru: Пожалуйста, введите ws inbound_port

source: 请输入 gRPC inbound_port
fa: لطفا GRPC inbound_port را وارد کنید
ru: Пожалуйста, введите grpc inbound_port

source: 此模式不支持修改 target
fa: این مدل از اصلاح هدف پشتیبانی نمی کند
ru: Эта модель не поддерживает изменение цели

source: 即将显示用户, 一次仅能显示一个
fa: کاربر در حال نمایش است ، فقط یک بار می تواند نمایش داده شود
ru: Пользователь должен быть отображен, только один может отображаться одновременно

source: 请选择 显示用户使用的协议 ws/gRPC
fa: لطفاً پروتکل WS/GRPC را که کاربر از آن استفاده می کند انتخاب کنید
ru: Пожалуйста, выберите протокол ws/grpc, который пользователь использует

source: 请选择 要显示的用户编号
fa: لطفاً شماره کاربر مورد نظر خود را انتخاب کنید
ru: Пожалуйста, выберите номер пользователя, который хотите отобразить

source: 选择错误
fa: یک خطا را انتخاب کنید
ru: Выберите ошибку

source: 请直接在主菜单选择 [15] 显示主用户
fa: لطفاً کاربر اصلی را مستقیماً در منوی اصلی انتخاب کنید [15]
ru: Пожалуйста, выберите основного пользователя непосредственно в главном меню [15]

source: 回到菜单
fa: بازگشت به منو
ru: Вернуться в меню

source: 请先检测 Xray 是否正确安装
fa: لطفاً بررسی کنید که آیا Xray به درستی نصب شده است
ru: Пожалуйста, проверьте, правильно ли установлен рентген

source: 用户名
fa: نام کاربری
ru: имя пользователя

source: 是否继续显示用户
fa: آیا برای ادامه نمایش کاربران
ru: Продолжать отображать пользователей

source: 此模式不支持删除用户
fa: این حالت از حذف کاربران پشتیبانی نمی کند
ru: Этот режим не поддерживает удаление пользователей

source: 即将添加用户, 一次仅能添加一个
fa: کاربر در حال اضافه شدن است ، فقط یک بار می تواند اضافه شود
ru: Пользователь должен быть добавлен, только один может быть добавлен за раз

source: 请选择 添加用户使用的协议 ws/gRPC
fa: لطفاً پروتکل WS/GRPC مورد استفاده کاربر را انتخاب کنید
ru: Пожалуйста, выберите протокол WS/GRPC, используемый пользователем

source: 添加用户
fa: کاربران را اضافه کنید
ru: Добавить пользователей

source: 是否继续添加用户
fa: آیا به اضافه کردن کاربران ادامه می دهید
ru: Вы продолжаете добавлять пользователей

source: 此模式不支持添加用户
fa: این مدل از افزودن کاربران پشتیبانی نمی کند
ru: Эта модель не поддерживает добавление пользователей

source: 即将删除用户, 一次仅能删除一个
fa: کاربر در حال حذف است ، فقط یک بار می توان حذف کرد
ru: Пользователь собирается удалить, только один может быть удален за раз

source: 请选择 删除用户使用的协议 ws/gRPC
fa: لطفاً پروتکل مورد استفاده کاربر WS/GRPC را حذف کنید
ru: Пожалуйста, выберите удаление протокола, используемого пользователем WS/GRPC

source: 请选择 要删除的用户编号
fa: لطفاً شماره کاربر را حذف کنید
ru: Пожалуйста, выберите номер пользователя, который будет удален

source: 请直接在主菜单修改主用户的 UUID/Email
fa: لطفاً UUID/ایمیل کاربر اصلی را مستقیماً در منوی اصلی تغییر دهید
ru: Пожалуйста, измените UUID/электронное письмо основного пользователя непосредственно в главном меню

source: 删除用户
fa: کاربران را حذف کنید
ru: Удалить пользователей

source: 是否继续删除用户
fa: آیا شما همچنان به حذف کاربر ادامه می دهید
ru: Вы продолжаете удалять пользователя

source: log文件不存在
fa: پرونده ورود به سیستم وجود ندارد
ru: Файл журнала не существует

source: 已配置 Xray 流量统计
fa: آمار ترافیک Xray را محاسبه کرد
ru: Рассчитанная статистика рентгеновского трафика

source: 是否需要关闭此功能
fa: آیا شما نیاز به بستن این عملکرد دارید
ru: Вам нужно закрыть эту функцию

source: 关闭 Xray 流量统计
fa: نزدیک آمار ترافیک Xray
ru: Закрыть рентгеновский трафик статистики

source: Xray 流量统计需要使用 api
fa: آمار ترافیک Xray باید از API استفاده کند
ru: Статистика рентгеновского трафика должна использовать API

source: 可能会影响 Xray 性能
fa: این ممکن است بر عملکرد Xray تأثیر بگذارد
ru: Это может повлиять на производительность рентгеновских

source: 设置 Xray 流量统计
fa: آمار ترافیک Xray را تنظیم کنید
ru: Установите статистику трафика рентгеновского движения

source: 已卸载 Xray
fa: Xray نصب نشده
ru: Установлен рентгенов

source: 是否卸载 Nginx
fa: آیا باید nginx را حذف نصب کنید
ru: Удалить Nginx

source: 已卸载 Nginx
fa: nginx حذف نشده است
ru: Nginx был удален

source: 是否删除所有脚本文件
fa: آیا می توان همه پرونده های اسکریپت را حذف کرد
ru: Удалить все файлы сценариев

source: 已删除所有文件
fa: همه پرونده ها حذف شده اند
ru: Все файлы были удалены

source: ヾ(￣▽￣) 拜拜~
fa: ￣ (▽ ▽ 拜) خداحافظ
ru: ￣ (▽ ▽ 拜) пока ~

source: 已保留脚本文件 (包含 SSL 证书等)
fa: یک پرونده اسکریپت حفظ شده است (از جمله گواهی SSL و غیره)
ru: Файл сценария был сохранен (включая сертификат SSL и т. Д.)

source: 是否保留配置文件
fa: آیا برای نگه داشتن پرونده پیکربندی
ru: Хранить файл конфигурации

source: 已清空证书遗留文件
fa: اسناد باقی مانده از گواهینامه
ru: Документы оставили сертификат

source: 秒后将
fa: بعد از یک ثانیه خواهد بود
ru: Будет через секунду

source: 检测最新版本失败!
fa: آخرین نسخه شکست خورد!
ru: Последняя версия не удалась!

source: 存在新版本, 但版本跨度较大, 可能存在不兼容情况, 是否更新
fa: نسخه های جدیدی وجود دارد ، اما طول نسخه بزرگ است ، و ممکن است ناسازگاری وجود داشته باشد.
ru: Есть новые версии, но Span Version большой, и может быть несовместимость.

source: 存在新版本, 是否更新
fa: آیا نسخه جدیدی وجود دارد ، چه به روز کنید
ru: Есть ли новая версия, обновляется ли

source: 检测 脚本 最新版本失败!
fa: آخرین نسخه اسکریپت تشخیص شکست خورد!
ru: Последняя версия сценария обнаружения не удалась!

source: 脚本 版本差别过大, 跳过更新!
fa: نسخه اسکریپت خیلی متفاوت است ، بروزرسانی را پرش کنید!
ru: Версия скрипта слишком отличается, пропустите обновление!

source: 更新完成
fa: بروزرسانی
ru: Обновлять

source: 脚本版本跨度较大, 若服务无法正常运行请卸载后重装!
fa: نسخه اسکریپت بزرگ است.
ru: Версия сценария большая.

source: 当前版本为最新版本
fa: نسخه فعلی آخرین نسخه است
ru: Текущая версия - последняя версия

source: 下载最新脚本
fa: آخرین اسکریپت را بارگیری کنید
ru: Скачать последний сценарий

source: 该选项暂时无法使用
fa: این گزینه به طور موقت در دسترس نیست
ru: Этот вариант временно недоступен

source: 此模式推荐用于负载均衡, 一般情况不推荐使用, 是否安装
fa: این مدل برای تعادل بار توصیه می شود.
ru: Эта модель рекомендуется для балансировки нагрузки.

source: 变更 Nginx 负载均衡配置
fa: پیکربندی تعادل بار Nginx را تغییر دهید
ru: Изменить конфигурацию балансировки нагрузки Nginx

source: 变更 Nginx serverNames 配置
fa: تغییر پیکربندی nginx servernames
ru: Изменить конфигурацию Nginx ServerNames

source: 清除日志文件
fa: پرونده ورود به سیستم را پاک کنید
ru: Очистить файл журнала

source: 查看证书状态
fa: مشاهده وضعیت گواهی
ru: Просмотреть статус сертификата

source: 更新证书有效期
fa: دوره اعتبار گواهی تجدید
ru: Период достоверности сертификата об продлении

source: 设置证书自动更新
fa: به روزرسانی خودکار گواهینامه را تنظیم کنید
ru: Установите автоматическое обновление сертификата

source: 设置 Fail2ban 防暴力破解
fa: SET FAIL2BAN CRACKING ضد خشونت
ru: SET FAIL2 BANBAN ANTIVILENTIC CRACKING

source: 显示帮助
fa: راهنما نمایش
ru: Показать помощь

source: 更新
fa: تمدید کردن
ru: обновлять

source: 变更
fa: تغییر
ru: изменять

source: 脚本卸载
fa: فیلمنامه حذف نصب
ru: Скрипт удаляет

source: 显示安装信息
fa: نمایش اطلاعات نصب
ru: Отображать информацию об установке

source: 配置 TCP 加速
fa: شتاب TCP را پیکربندی کنید
ru: Настройка ускорения TCP

source: 修改 TLS 配置
fa: پیکربندی TLS را اصلاح کنید
ru: Изменить конфигурацию TLS

source: 升级脚本
fa: اسکریپت ارتقاء
ru: Обновить скрипт

source: 映射字符串
fa: رشته نقشه برداری
ru: Картирование строки

source: 显示
fa: نشان دادن
ru: показывать

source: 访问信息
fa: دسترسی به اطلاعات
ru: Доступ к информации

source: 错误信息
fa: پیام خطا
ru: Сообщение об ошибке

source: 脚本版本跨度较大, 可能存在不兼容情况, 是否继续使用
fa: نسخه اسکریپت بزرگ است ، و ممکن است ناسازگاری وجود داشته باشد ، چه باید به استفاده ادامه داد
ru: Версия скрипта большая, и может быть несовместимость, будь то продолжать использовать

source: 脚本版本跨度较大, 若服务无法正常运行请卸载后重装
fa: نسخه اسکریپت بزرگ است ، اگر سرویس نمی تواند به طور عادی اجرا شود ، لطفاً پس از حذف نصب مجدد آن را دوباره نصب کنید
ru: Версия скрипта большая, если сервис не может работать нормально, пожалуйста, переустановите ее после удаления

source: 检测失败
fa: عدم موفقیت
ru: Обнаружить сбой

source: 有新版
fa: نسخه جدیدی داشته باشید
ru: Иметь новую версию

source: 最新版
fa: آخرین نسخه
ru: Последняя версия

source: 版本未知
fa: نسخه ناشناخته
ru: Неизвестная версия

source: 有测试版
fa: نسخه تست
ru: Тестовая версия

source: 运行中..
fa: در حین کار ..
ru: Во время операции ..

source: 无需测试
fa: بدون تست
ru: Нет теста

source: 未运行
fa: دویدن
ru: Не работает

source: 无法连通
fa: اتصال امکان پذیر نیست
ru: Невозможно подключиться

source: 本地正常
fa: موضعی
ru: Местный нормальный

source: 脚本维护中.. 请稍后再试!
fa: تعمیر و نگهداری اسکریپت .. لطفا بعداً آن را امتحان کنید!
ru: Техническое обслуживание сценария .. попробуйте позже!

source: 无法检测所需依赖的在线版本, 请稍后再试!
fa: نمی توانید نسخه آنلاین مورد نیاز خود را تشخیص دهید ، لطفاً بعداً آن را امتحان کنید!
ru: Не могу обнаружить необходимую онлайн -версию, попробуйте позже!

source: 选择语言 / Select Language / انتخاب زبان / Выберите язык
fa: زبان را انتخاب کنید / زبان را انتخاب کنید / antخabab زban / Выерите entзызы
ru: Выберите язык / выберите язык / انتخاب زبان / vыberite

source: 请输入数字
fa: لطفا شماره را وارد کنید
ru: Пожалуйста, введите номер

source: 请输入 1 到 4 之间的有效数字
fa: لطفاً شماره معتبر را بین 1 تا 4 وارد کنید
ru: Пожалуйста, введите действительный номер от 1 до 4

source: 无效的选择
fa: انتخاب نامعتبر
ru: Неверный выбор

source: 检测存在到 BUG !
fa: تشخیص برای اشکال وجود دارد!
ru: Обнаружение существует в ошибке!

source: BUG 来源于自动清理日志错误的设置
fa: اشکال از تنظیم خطای ورود به سیستم اتوماتیک ناشی می شود
ru: Ошибка происходит из настройки ошибки автоматического журнала очистки

source: 开始修复..
fa: شروع را شروع کنید ..
ru: Начать ремонт ..

source: 错误的配置文件删除
fa: پرونده پیکربندی اشتباه را حذف کنید
ru: Удалить неправильный файл конфигурации

source: 即将重新设置自动清理日志..
fa: ورود به سیستم تمیز کردن اتوماتیک به زودی تنظیم می شود ..
ru: Автоматическое журнал очистки скоро будет настроен ..

source: 安装管理脚本
fa: اسکریپت مدیریت نصب
ru: Сценарий управления установкой

source: 作者
fa: نویسنده
ru: автор

source: 修改
fa: تجدید نظر کردن
ru: Исправлять

source: 当前模式
fa: حالت فعلی
ru: Текущий режим

source: 当前语言
fa: زبان فعلی
ru: Текущий язык

source: 可以使用
fa: در دسترس بودن
ru: Быть доступным

source: 命令管理脚本
fa: اسکریپت مدیریت فرمان
ru: Сценарий управления командами

source: 版本检测
fa: کشف نسخه
ru: Обнаружение версии

source: 脚本
fa: فیلمنامه
ru: сценарий

source: 运行状态
fa: وضعیت در حال اجرا
ru: Статус работы

source: 连通性
fa: اتصال
ru: Подключение

source: 升级向导
fa: راهنمای ارتقاء
ru: Руководство по обновлению

source: 安装向导
fa: جادوگر نصب
ru: Мастер установки

source: 配置变更
fa: تغییر پیکربندی
ru: Изменение конфигурации

source: 版本
fa: نسخه
ru: Версия

source: 负载均衡配置
fa: پیکربندی تعادل بار
ru: Нагрузка балансировки конфигурации

source: 配置
fa: پیکربندی
ru: Конфигурация

source: 用户管理
fa: مدیریت کاربر
ru: Управление пользователями

source: 查看
fa: بررسی کردن
ru: Проверять

source: 用户
fa: کاربر
ru: пользователь

source: 添加
fa: اضافه کردن
ru: добавить в

source: 删除
fa: حذف کردن
ru: удалить

source: 查看信息
fa: اطلاعات را بررسی کنید
ru: Проверьте информацию

source: 实时访问日志
fa: ورود به سیستم واقعی
ru: Реальное посещение журнала

source: 实时错误日志
fa: گزارش خطای زمان واقعی
ru: Реальное время ошибки

source: 配置信息
fa: اطلاعات پیکربندی
ru: Информация о конфигурации

source: 服务相关
fa: دارای خدمات مرتبط
ru: Сервис -связанный

source: 重启
fa: مجدداً
ru: Перезапуск

source: 所有服务
fa: کلیه خدمات
ru: Все услуги

source: 启动
fa: شروع کردن
ru: запускать

source: 停止
fa: توقف
ru: останавливаться

source: 证书相关
fa: گواهینامه مرتبط
ru: Сертификат -связанный

source: 证书状态
fa: وضعیت گواهینامه
ru: Статус сертификата

source: 证书有效期
fa: دوره اعتبار گواهینامه ها
ru: Период достоверности сертификатов

source: 设置
fa: تنظیم کردن
ru: настраивать

source: 证书自动更新
fa: به روزرسانی گواهینامه خودکار
ru: Автоматическое обновление сертификата

source: 其他选项
fa: گزینه های دیگر
ru: Другие варианты

source: 自动更新
fa: بروزرسانی خودکار
ru: Автоматическое обновление

source: 加速
fa: تسریع کردن
ru: ускорить

source: 防暴力破解
fa: ترک خوردگی ضد خشونت
ru: Против насилия трещины

source: 流量统计
fa: آمار جریان
ru: Статистика потока

source: 清除
fa: برداشتن
ru: Удалять

source: 日志文件
fa: پرونده ورود به سیستم
ru: Файл журнала

source: 测试
fa: تست
ru: тест

source: 服务器网速
fa: سرعت شبکه سرور
ru: Серверная сеть скорости

source: 卸载向导
fa: بارگیری کردن
ru: Разгрузка

source: 卸载
fa: حذف کردن
ru: удалить

source: 清空
fa: خالی
ru: Пустой

source: 证书文件
fa: پرونده گواهینامه
ru: Файл сертификата

source: 退出
fa: ترک
ru: покидать

source: 请输入选项
fa: لطفا گزینه را وارد کنید
ru: Пожалуйста, введите вариант

source: 请输入 0 到 34 之间的有效数字
fa: لطفاً شماره معتبر را بین 0 تا 34 وارد کنید
ru: Пожалуйста, введите действительный номер от 0 до 34

source: 开始升级!
fa: شروع را به روز کنید!
ru: Запустите обновление!

source: 变更 UUIDv5/映射字符串
fa: رشته UUIDV5/نقشه برداری را تغییر دهید
ru: Изменить uuidv5/mapping String

source: 变更 port
fa: بندر را تغییر دهید
ru: Изменить порт

source: 变更 target
fa: هدف را تغییر دهید
ru: Изменить цель

source: 变更 TLS 版本
fa: نسخه TLS را تغییر دهید
ru: Измените версию TLS

source: 回到菜单!
fa: بازگشت به منو!
ru: Вернуться в меню!

source: 请输入正确的数字!
fa: لطفا شماره صحیح را وارد کنید!
ru: Пожалуйста, введите правильный номер!

source: 设置 Fail2ban 用于防止暴力破解, 请选择:
fa: FAIL2BAN را برای جلوگیری از ترک خوردگی بی رحمانه تنظیم کنید ، لطفاً انتخاب کنید:
ru: Установите Fail2ban, чтобы предотвратить грубое растрескивание, выберите:

source: 管理
fa: مدیریت کردن
ru: управлять

source: 状态
fa: حالت
ru: состояние

source: 请输入:
fa: لطفا وارد کنید:
ru: Пожалуйста, введите:

source: 无效的选择 请重试
fa: اگر انتخاب نامعتبر است ، لطفاً آن را امتحان کنید
ru: Если неверный выбор, попробуйте

source: Fail2ban 已经安装, 跳过安装步骤
fa: Fail2ban نصب شده است و مراحل نصب را پرش می کند
ru: Fail2ban был установлен, пропуская шаги установки

source: Nginx 未安装, 请先安装 Nginx
fa: nginx نصب نشده است ، لطفاً ابتدا nginx را نصب کنید
ru: Nginx не установлен, пожалуйста, установите Nginx сначала

source: Fail2ban 未安装, 请先安装 Fail2ban
fa: fail2ban نصب نشده است ، لطفاً ابتدا Fail2ban را نصب کنید
ru: Fail2ban не установлен, пожалуйста, установите Fail2ban First

source: 请选择 Fail2ban 操作:
fa: لطفاً عملکرد FAIL2BAN را انتخاب کنید:
ru: Пожалуйста, выберите операцию Fail2ban:

source: 添加自定义规则
fa: قوانین سفارشی را اضافه کنید
ru: Добавьте пользовательские правила

source: 请输入新的 Jail 名称:
fa: لطفاً نام زندان جدید را وارد کنید:
ru: Пожалуйста, введите новое имя тюрьмы:

source: 请输入 Filter 名称:
fa: لطفاً نام فیلتر را وارد کنید:
ru: Пожалуйста, введите имя фильтра:

source: 请输入日志路径:
fa: لطفاً مسیر ورود به سیستم را وارد کنید:
ru: Пожалуйста, введите путь журнала:

source: 请输入最大重试次数 (默认 5):
fa: لطفاً حداکثر تعداد بررسی ها را وارد کنید (پیش فرض 5):
ru: Пожалуйста, введите максимальное количество обзоров (по умолчанию 5):

source: 最大重试次数必须在 1 到 99 之间
fa: حداکثر تعداد قیام باید بین 1 تا 99 باشد
ru: Максимальное количество повторений должно быть от 1 до 99

source: 请输入封禁时间 (秒, 默认 604800 秒):
fa: لطفاً زمان ممنوعیت را وارد کنید (دوم ، پیش فرض 604800 ثانیه):
ru: Пожалуйста, введите время запрета (второе, по умолчанию 604800 секунд):

source: 封禁时间必须在 1 到 8640000 秒之间
fa: زمان ممنوعیت باید بین 1 تا 86.40000 ثانیه باشد
ru: Запрещенное время должно составлять от 1 до 86 40000 секунд

source: Jail
fa: زندان
ru: Тюрьма

source: 已存在
fa: وجود داشتن
ru: Существовать

source: 自定义规则添加成功
fa: قوانین سفارشی با موفقیت اضافه می شوند
ru: Индивидуальные правила успешно добавлены

source: 重启以应用新规则
fa: برای اعمال قوانین جدید مجدداً راه اندازی کنید
ru: Перезапустить, чтобы применять новые правила

source: Fail2ban 停止成功
fa: fail2ban موفقیت را متوقف کنید
ru: FAIL2 BANBEP Успех

source: Fail2ban 总体状态:
fa: Fail2ban وضعیت عمومی:
ru: FAIL2 Общий статус:

source: 默认启用的 Jail 状态:
fa: وضعیت زندان به طور پیش فرض افتتاح شد:
ru: Статус тюрьмы открывается по умолчанию:

source: SSH 封锁情况:
fa: محاصره SSH:
ru: SSH блокада:

source: Fail2ban Nginx 封锁情况:
fa: محاصره Fail2ban nginx:
ru: Fail2ban Blockade Nginx:

source: Fail2ban Nginx No Host 封锁情况:
fa: FAIL2BAN NGINX بدون محاصره میزبان:
ru: FAISH2BAN NGINX НЕТ БЛОКАДА ХОСТИ:

source: 新版本可用:
fa: نسخه جدید موجود:
ru: Новая версия доступна:

source: 当前版本:
fa: نسخه فعلی:
ru: Текущая версия:

source: 请访问 https://github.com/hello-yunshu/Xray_bash_onekey 查看更新说明
fa: لطفاً به https://github.com/hello- yunshu/xray_bash_onekey مشاهده کنید
ru: Пожалуйста, посетите https://github.com/hello- Yunshu/xray_bash_onekey Просмотреть инструкции

source: 是否要下载并安装新版本
fa: خواه بخواهید نسخه جدیدی را بارگیری و نصب کنید
ru: Хотите ли вы скачать и установить новую версию

source: 正在下载新版本...
fa: بارگیری نسخه جدید ...
ru: Скачать новую версию ...

source: 下载完成，正在重新运行脚本...
fa: بارگیری کامل شده است ، و فیلمنامه دوباره ...
ru: Загрузка завершена, а сценарий re -run ...
