Repository: cysk003/Xray_bash_onekey
Catalog: po/*.po
Languages: fa, ru

source: 跳过更新
fa: از بروزرسانی پرش کنید
ru: Пропустите обновление

source: 当前已经是最新版本:
fa: این آخرین نسخه است:
ru: Это уже последняя версия:

source: 用法:
fa: استفاده:
ru: Использование:

source: <文件扩展名> [<目录路径>]
fa: <نام فرمت پرونده> [مسیر دایرکتوری>]
ru: <Имя расширения файла> [Путь каталога>]

source: 目录
fa: فهرست مطالب
ru: Оглавление

source: 不存在 请检查路径
fa: اگر وجود وجود ندارد ، لطفاً مسیر را بررسی کنید
ru: Если нет существования, пожалуйста, проверьте путь

source: 列出所有
fa: لیست همه
ru: Список всех

source: 文件
fa: مدرک
ru: документ

source: 没有找到
fa: یافت نشد
ru: Не найдено

source: 文件名
fa: نام پرونده
ru: имя файла

source: 序号
fa: شماره سریال
ru: Серийный номер

source: 请输入网址 (例如 hey.run)
fa: لطفاً URL را وارد کنید (به عنوان مثال Hey.run)
ru: Пожалуйста, введите URL (например, Hey.Run)

source: 不要包含 http:// 或 https:// 开头
fa: http: // یا https: // را شامل نمی شود
ru: Не включайте http: // или https: //

source: 网址不能包含 http:// 或 https:// 开头
fa: URL ها نمی توانند شامل http:/ یا https: //
ru: URL не могут включать http:/ или https: //

source: 已创建
fa: ایجاد کرده اند
ru: Создали

source: 请输入主机 (host):
fa: لطفاً میزبان (میزبان) را وارد کنید:
ru: Пожалуйста, введите хост (хост):

source: 请输入端口 (port):
fa: لطفا وارد پورت (پورت) شوید:
ru: Пожалуйста, введите порт (порт):

source: 请输入权重 (0~100 默认值 50):
fa: لطفاً وزن (مقدار پیش فرض 100 ~ 100) را وارد کنید:
ru: Пожалуйста, введите вес (0 ~ 100 Значение по умолчанию 50):

source: 防火墙 追加 完成
fa: تکمیل اضافی فایروال
ru: Брандмауэр Дополнительное завершение

source: 请输入要编辑的文件编号
fa: لطفاً شماره پرونده را برای ویرایش وارد کنید
ru: Пожалуйста, введите номер файла, который будет отредактирован

source: vim 未安装 正在尝试安装
fa: VIM نصب نشده و در تلاش است تا نصب کند
ru: Vim не установлен и пытается установить

source: 已编辑
fa: ویرایش شده
ru: Отредактировано

source: 请输入要删除的文件编号
fa: لطفاً شماره پرونده را حذف کنید تا حذف شود
ru: Пожалуйста, введите номер файла, который будет удален

source: 不支持的文件扩展名
fa: نام فرمت فایل غیرقابل دستیابی
ru: Недостатимое имя расширения файла

source: 主菜单
fa: منوی اصلی
ru: Основное меню

source: 创建一个新的
fa: جدید ایجاد کنید
ru: Создать новый

source: 编辑一个已存在的
fa: یک موجود موجود را ویرایش کنید
ru: Отредактировать существующее существование

source: 删除一个已存在的
fa: یک موجود موجود را حذف کنید
ru: Удалить один существующий

source: 请选择一个选项:
fa: لطفاً یک گزینه را انتخاب کنید:
ru: Пожалуйста, выберите опцию:

source: Nginx 重启成功
fa: Nginx موفقیت را دوباره آغاز کرد
ru: Nginx перезапустил успех

source: Nginx 重启失败 请检查配置文件是否有误
fa: راه اندازی مجدد Nginx انجام نشد ، لطفاً بررسی کنید که آیا پرونده پیکربندی اشتباه است
ru: Перезапуск Nginx не удался, пожалуйста, проверьте, неправильно ли файл конфигурации
